### 连接数据库

In [110]:
import sqlite3

conn = sqlite3.connect('../../temp/test.db')

print("数据库打开成功")

数据库打开成功

### 创建表

In [111]:
c = conn.cursor()
c.execute('''CREATE TABLE COMPANY(
                     ID INT PRIMARY  KEY     NOT NULL,
                     NAME            TEXT    NOT NULL,
                     AGE             INT     NOT NULL,
                     ADDRESS         CHAR(50),
                     SALARY          REAL);''')
print("数据表创建成功")
conn.commit()

数据表创建成功

### 插入数据

In [112]:
c.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (1, 'Paul', 32, 'California', 20000.00 )")
c.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (2, 'Allen', 25, 'Texas', 15000.00 )")
c.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )")
c.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )")

conn.commit()
print("数据插入成功")

数据插入成功

### 查询数据

In [113]:
cursor = c.execute("SELECT id, name, address, salary  from COMPANY")
for row in cursor:
    print(row)

print ("数据操作成功")

(1, 'Paul', 'California', 20000.0)
(2, 'Allen', 'Texas', 15000.0)
(3, 'Teddy', 'Norway', 20000.0)
(4, 'Mark', 'Rich-Mond ', 65000.0)
数据操作成功

### 修改数据

In [114]:
c.execute("UPDATE COMPANY set SALARY = 25000.00 where ID=1")
conn.commit()
print("Total number of rows updated :", conn.total_changes)

cursor = conn.execute("SELECT id, name, address, salary  from COMPANY")
for row in cursor:
    print(row)

print("数据操作成功")

Total number of rows updated : 5
(1, 'Paul', 'California', 25000.0)
(2, 'Allen', 'Texas', 15000.0)
(3, 'Teddy', 'Norway', 20000.0)
(4, 'Mark', 'Rich-Mond ', 65000.0)
数据操作成功

### 删除数据

In [115]:
c.execute("DELETE from COMPANY where ID=2;")
conn.commit()
print("Total number of rows deleted :", conn.total_changes)

cursor = conn.execute("SELECT id, name, address, salary  from COMPANY")
for row in cursor:
    print(row)

print("数据操作成功")

Total number of rows deleted : 6
(1, 'Paul', 'California', 25000.0)
(3, 'Teddy', 'Norway', 20000.0)
(4, 'Mark', 'Rich-Mond ', 65000.0)
数据操作成功

## 查询结果为dict

In [116]:
conn.row_factory = sqlite3.Row
c = conn.cursor()
c.execute('SELECT id, name, address, salary  from COMPANY')

result =  [dict(row) for row in c.fetchall()]
for r in result:
    print(r)

{'ID': 1, 'NAME': 'Paul', 'ADDRESS': 'California', 'SALARY': 25000.0}
{'ID': 3, 'NAME': 'Teddy', 'ADDRESS': 'Norway', 'SALARY': 20000.0}
{'ID': 4, 'NAME': 'Mark', 'ADDRESS': 'Rich-Mond ', 'SALARY': 65000.0}

### 删除表

In [117]:
c.execute("DROP table  COMPANY")
conn.commit()
print("数据操作成功")
conn.close()

数据操作成功